Tekla.Structures.Drawing.ArrowheadTypes
The arrowhead types.

Tekla.Structures.Drawing.ArrowheadTypes.NoArrow
No arrowhead.

Tekla.Structures.Drawing.ArrowheadTypes.FilledArrow
The filled arrowhead.

Tekla.Structures.Drawing.ArrowheadTypes.LineArrow
The line arrowhead.

Tekla.Structures.Drawing.ArrowheadTypes.CircleArrow
The open circle arrowhead.

Tekla.Structures.Drawing.ArrowheadTypes.FilledCircleArrow
The filled circle arrowhead.